<a href="https://colab.research.google.com/github/MagdaSousa/Estudo_Pandas/blob/master/merge_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [45]:
import pandas as pd

Cadastro da loja A

In [46]:
cadastro_a ={"ID":["AA2930","BB4563","CC2139","DE2521","GT3462","HH1138"],
             "NOME":["VICTOR","AMANDA","RENATO","ESTER","REGINA","RENAN"],
             "IDADE":[50,20,30,40,25,23],
             "CEP":["90890-098","23478-897","12345-324","23415-678","12354-895","22267-789"]}

cadastro_a= pd.DataFrame(cadastro_a,columns =["ID","NOME","IDADE","CEP"])
cadastro_a

       ID    NOME  IDADE        CEP
0  AA2930  VICTOR     50  90890-098
1  BB4563  AMANDA     20  23478-897
2  CC2139  RENATO     30  12345-324
3  DE2521   ESTER     40  23415-678
4  GT3462  REGINA     25  12354-895
5  HH1138   RENAN     23  22267-789

In [47]:
cadastro_b ={"ID":["AA3330","BB5663","CC7639","DE3421","GT9862","HH1138"],
             "NOME":["VITORIA","EDUARDA","CRISTIANO","JULIA","TATIANA","RENAN"],
             "IDADE":[40,10,40,80,35,93],
             "CEP":["45637-098","28478-897","88345-324","33315-678","55554-895","22267-789"]}

cadastro_b= pd.DataFrame(cadastro_b,columns =["ID","NOME","IDADE","CEP"])
cadastro_b

       ID       NOME  IDADE        CEP
0  AA3330    VITORIA     40  45637-098
1  BB5663    EDUARDA     10  28478-897
2  CC7639  CRISTIANO     40  88345-324
3  DE3421      JULIA     80  33315-678
4  GT9862    TATIANA     35  55554-895
5  HH1138      RENAN     93  22267-789

REGISTRO DE COMPRAS, QUE INCLUI AÇÕES FEITAS POR USUÁRIOS DAS DUAS LISTAS CADASTRADAS ACIMA :

In [48]:
compras ={"ID":["AA2930","BB4563","CC2139","DE3421","GT9862","HH6638"],
             "DATA":["2019-01-01","2019-01-02","2019-02-03","2019-03-11","2019-04-51","2019-11-21"],
             "VALOR":[200,100,400,800,350,930]}

compras= pd.DataFrame(compras,columns =["ID","DATA","VALOR"])
compras

       ID        DATA  VALOR
0  AA2930  2019-01-01    200
1  BB4563  2019-01-02    100
2  CC2139  2019-02-03    400
3  DE3421  2019-03-11    800
4  GT9862  2019-04-51    350
5  HH6638  2019-11-21    930

#UTILIZANDO O COMANDO MERGE

In [49]:
#pd.merge(tabela_da_esquerda,tabela_da_direita, on="coluna_coincidente", how="left|right|inner|outer")
#on -> Coluna onde quero fazer a análise
#how -> tipo de filtro(tratamento), que vou utilizar

In [50]:
?pd.merge()

# usando o "INNER"
Supondo que eu queira descobrir se um determinado cliente frequenta as duas lojas, as quais tem o cadastro, como cadastro_a(loja A) cadastro_b(loja B).Ou seja quero encontrar a intersecção entre as duas tabelas/lojas. Neste caso coloco o valor "inner",com valor do parâmetro how, o inner funciona igual as consultas SQL.

In [51]:
pd.merge(cadastro_a,cadastro_b, on=["ID"], how="inner")
# O resultado mostra que RENAN, frequenta tanto a loja A quanto a loja B, as letras "x" e "y", indicam as lojas, 
# no caso o "x" é referente a cadastro_a(loja A), e "y" está referenciando a cadastro_b(loja B)
#Como é um comando "inner", ele mostra os dados das duas tabelas, referente a aquele cliente que frequenta as duas lojas

       ID NOME_x  IDADE_x      CEP_x NOME_y  IDADE_y      CEP_y
0  HH1138  RENAN       23  22267-789  RENAN       93  22267-789

In [52]:
pd.merge(cadastro_a,cadastro_b[["ID","IDADE","CEP"]], on=["ID"], how="inner")
# CAso eu queira limitar ou filtrar apenas os campos de meu interesse na hora de filtrar como o comando "inner",
# basta colocar entre colchetes os campos de interesse, dentro de outro colchete ao lado da tabela escolhida para fazer o filtro

       ID   NOME  IDADE_x      CEP_x  IDADE_y      CEP_y
0  HH1138  RENAN       23  22267-789       93  22267-789

In [53]:
pd.merge(cadastro_a,cadastro_b[["ID","IDADE","CEP"]], on=["ID"], how="inner",suffixes=("_A","_B"))
#Caso quiser trocar estes sufixos "_y" ou "_X", que estão junto aos nomes das colunas da tabelas, basta atribuir os valores acima
# ao parâmetro suffixes

       ID   NOME  IDADE_A      CEP_A  IDADE_B      CEP_B
0  HH1138  RENAN       23  22267-789       93  22267-789

# Trabalhando com o Full join
Funciona assim como no SQL, e trará as informações das duas tabelas

In [54]:
# Podemos  fazer o mesmo processo do full join, com a função concat
# Neste caso ele vai apenas juntar as duas "lojas", mas como há clientes que frequentam as duas lojas, esta junção trará dados duplicados
pd.concat([cadastro_a,cadastro_b],ignore_index=True)

        ID       NOME  IDADE        CEP
0   AA2930     VICTOR     50  90890-098
1   BB4563     AMANDA     20  23478-897
2   CC2139     RENATO     30  12345-324
3   DE2521      ESTER     40  23415-678
4   GT3462     REGINA     25  12354-895
5   HH1138      RENAN     23  22267-789
6   AA3330    VITORIA     40  45637-098
7   BB5663    EDUARDA     10  28478-897
8   CC7639  CRISTIANO     40  88345-324
9   DE3421      JULIA     80  33315-678
10  GT9862    TATIANA     35  55554-895
11  HH1138      RENAN     93  22267-789

In [55]:
# Agora vou apagar os dados duplicados  na tabela
lojas_juntas =pd.concat([cadastro_a,cadastro_b],ignore_index=True)
clientes_unicos =lojas_juntas.drop_duplicates(subset='ID')
clientes_unicos

        ID       NOME  IDADE        CEP
0   AA2930     VICTOR     50  90890-098
1   BB4563     AMANDA     20  23478-897
2   CC2139     RENATO     30  12345-324
3   DE2521      ESTER     40  23415-678
4   GT3462     REGINA     25  12354-895
5   HH1138      RENAN     23  22267-789
6   AA3330    VITORIA     40  45637-098
7   BB5663    EDUARDA     10  28478-897
8   CC7639  CRISTIANO     40  88345-324
9   DE3421      JULIA     80  33315-678
10  GT9862    TATIANA     35  55554-895

# Utilizando o left join

In [56]:
pd.merge(cadastro_a,compras, on=["ID"], how="left")
# Neste caso queremos pegar algumas informações específicas da tabela compras e juntar com a tabela cadastro_a.
# Queremos saber dos  clientes que fizeram compras  estão cadastrados da loja A

       ID    NOME  IDADE        CEP        DATA  VALOR
0  AA2930  VICTOR     50  90890-098  2019-01-01  200.0
1  BB4563  AMANDA     20  23478-897  2019-01-02  100.0
2  CC2139  RENATO     30  12345-324  2019-02-03  400.0
3  DE2521   ESTER     40  23415-678         NaN    NaN
4  GT3462  REGINA     25  12354-895         NaN    NaN
5  HH1138   RENAN     23  22267-789         NaN    NaN

In [57]:
compras

       ID        DATA  VALOR
0  AA2930  2019-01-01    200
1  BB4563  2019-01-02    100
2  CC2139  2019-02-03    400
3  DE3421  2019-03-11    800
4  GT9862  2019-04-51    350
5  HH6638  2019-11-21    930

In [58]:
cadastro_a

       ID    NOME  IDADE        CEP
0  AA2930  VICTOR     50  90890-098
1  BB4563  AMANDA     20  23478-897
2  CC2139  RENATO     30  12345-324
3  DE2521   ESTER     40  23415-678
4  GT3462  REGINA     25  12354-895
5  HH1138   RENAN     23  22267-789

In [59]:
#neste caso ele vai buscar pelo "id", os clientes que tem compras e que frequentam a loja A, 
#os que aparecem com o valor NaN, são daqueles que não frequentam a loja A

In [60]:
esquerda=pd.merge(cadastro_a,compras, on=["ID"], how="left")

In [61]:
esquerda.groupby(["ID","NOME"])["VALOR"].sum()
# Neste caso, estou agrupando no dataframe esquerda, o "id" e "nome", junto com a coluna valor, somando o gasto individual de cada cliente
# Os que estão zerados, são os que não tinham compras cadastradas

ID      NOME
AA2930  VICTOR    200.0
BB4563  AMANDA    100.0
CC2139  RENATO    400.0
DE2521  ESTER       0.0
GT3462  REGINA      0.0
HH1138  RENAN       0.0
Name: VALOR, dtype: float64

#Aplicando o Outer

In [62]:
pd.merge(cadastro_a,cadastro_b, on=["ID"], how="outer")
#Neste caso junto as duas tabelas, onde  o cliente faz compra nas duas lojas, terá registro duplicado, onde não houver vica NaN

        ID  NOME_x  IDADE_x      CEP_x     NOME_y  IDADE_y      CEP_y
0   AA2930  VICTOR     50.0  90890-098        NaN      NaN        NaN
1   BB4563  AMANDA     20.0  23478-897        NaN      NaN        NaN
2   CC2139  RENATO     30.0  12345-324        NaN      NaN        NaN
3   DE2521   ESTER     40.0  23415-678        NaN      NaN        NaN
4   GT3462  REGINA     25.0  12354-895        NaN      NaN        NaN
5   HH1138   RENAN     23.0  22267-789      RENAN     93.0  22267-789
6   AA3330     NaN      NaN        NaN    VITORIA     40.0  45637-098
7   BB5663     NaN      NaN        NaN    EDUARDA     10.0  28478-897
8   CC7639     NaN      NaN        NaN  CRISTIANO     40.0  88345-324
9   DE3421     NaN      NaN        NaN      JULIA     80.0  33315-678
10  GT9862     NaN      NaN        NaN    TATIANA     35.0  55554-895

In [63]:
pd.merge(cadastro_a,cadastro_b, on=["ID"], how="outer",indicator=True)
# Se colocarmos o atributo indicator, com valor true ele irá inserir uma coluna como o nome "merge", e esta terá a indicação
# se o valor está na tabela da direita ou esquerda

        ID  NOME_x  IDADE_x  ... IDADE_y      CEP_y      _merge
0   AA2930  VICTOR     50.0  ...     NaN        NaN   left_only
1   BB4563  AMANDA     20.0  ...     NaN        NaN   left_only
2   CC2139  RENATO     30.0  ...     NaN        NaN   left_only
3   DE2521   ESTER     40.0  ...     NaN        NaN   left_only
4   GT3462  REGINA     25.0  ...     NaN        NaN   left_only
5   HH1138   RENAN     23.0  ...    93.0  22267-789        both
6   AA3330     NaN      NaN  ...    40.0  45637-098  right_only
7   BB5663     NaN      NaN  ...    10.0  28478-897  right_only
8   CC7639     NaN      NaN  ...    40.0  88345-324  right_only
9   DE3421     NaN      NaN  ...    80.0  33315-678  right_only
10  GT9862     NaN      NaN  ...    35.0  55554-895  right_only

[11 rows x 8 columns]